[
  {
    "date": "September 15th",
    "eventExpires": "2024-09-15",
    "title": "Food Bank Sunday",
    "description": "Please bring non-perishable food items to donate to the local food bank. Items can be placed in the donation box in the foyer."
  },
  {
    "title": "Grief Share",
    "date": "September 7 - November 30",
    "eventExpires": "2024-11-30",
    "time": "10AM - 12PM",
    "description": "Meeting Saturdays at Florence-Carlton church. Group discussion will follow each free session. Each session includes a short video featuring interviews with grief recovery experts and real-life stories of people who have experienced the death of a loved one. Contact the church office for more information.",
    "eventLink": {
      "href": "https://www.griefshare.org/groups/243148",
      "text": "Register Here"
    }
  },
  {
    "date": "September 28th",
    "eventExpires": "2024-09-28",
    "time": "9:00am - 4:00pm",
    "title": "Stand Firm Apologetics Seminar",
    "description": "This free seminar equips believers to give a reason for their faith. It helps adults and children alike discern the messages of the world. Lunch and childcare are provided. See Karen Moore for more information or to sign up. Informational flyers are in the foyer."
  },
  {
    "date": "September 20th - 22nd",
    "eventExpires": "2024-09-22",
    "title": "Bitterroot Valley Ladies Retreat",
    "description": "Join the retreat at Big Sky Bible Camp in Big Fork, MT. Find more information and a registration form on the bulletin board in the foyer."
  },
  {
    "date": "September 8th",
    "eventExpires": "2024-09-08",
    "time": "2:30-3:30pm",
    "title": "Bitterroot Living Center Ministry",
    "description": "Our church will be hosting a worship service at BVLC. This is a wonderful opportunity to minister to the residents by visiting, holding bibles and song books, and encouraging them in the Lord."
  },
  {
    "date": "September 15th",
    "eventExpires": "2024-09-15",
    "time": "After Church",
    "title": "Nursery and 3-K Sunday School Meeting",
    "description": "This is the last chance for all volunteers to attend a meeting in the 3-K Classroom. Please let Heather Mapledoram know if you cannot attend."
  },
  {
    "title": "Baby Shower for Spann & Tybur Families",
    "date": "September 17th",
    "eventExpires": "2024-09-17",
    "time": "6:30PM",
    "description": "A baby shower for Meaghan & Matt Spann (expecting a boy) and Cole & Selena Tybur. Spanns need diapers & wipes, Tyburs need burp cloths, socks, onesies, gowns & clothes. Dessert will be served."
  },
  {
    "title": "Bridal Shower for Cadence Brown",
    "date": "September 27th",
    "eventExpires": "2024-09-27",
    "time": "6:00PM",
    "description": "Join us for food, fellowship, and showering Cadence & Reuben with gifts for their new life together. They are registered on Amazon and Target. Bring a wedding photo (optional)."
  },
  {
    "title": "Life Chain",
    "date": "October 6th",
    "time": "2:30PM - 3:30PM",
    "description": "Annual pro-life event hosted by Pro-Life Bitterroot. Participants will line 1st Street in Hamilton in prayer against abortion. For this hour, people will gather to express their support for the sanctity of life. If you plan to attend, please put your name on the sign-up sheet in the foyer. For more information, contact Dianne Orton.",
    "eventExpires": "2024-10-06"
  }
]
