[
  {
    "date": "September 15th",
    "eventExpires": "2024-09-15",
    "title": "Food Bank Sunday",
    "description": "Please bring non-perishable food items to donate to the local food bank. Items can be placed in the donation box in the foyer."
  },
  {
    "title": "Grief Share",
    "date": "September 7 - November 30",
    "eventExpires": "2024-11-30",
    "time": "10AM - 12PM",
    "description": "Meeting Saturdays at Florence-Carlton church. Group discussion will follow each free session. Each session includes a short video featuring interviews with grief recovery experts and real-life stories of people who have experienced the death of a loved one. Contact the church office for more information.",
    "eventLink": {
      "href": "https://www.griefshare.org/groups/243148",
      "text": "Register Here"
    }
  },
  {
    "title": "Life Chain",
    "date": "October 6th",
    "time": "2:30PM - 3:30PM",
    "description": "Annual pro-life event hosted by Pro-Life Bitterroot. Participants will line 1st Street in Hamilton in prayer against abortion. For this hour, people will gather to express their support for the sanctity of life. If you plan to attend, please put your name on the sign-up sheet in the foyer. For more information, contact Dianne Orton.",
    "eventExpires": "2024-10-06"
  },
  {
    "title": "Bitterroot Valley Living Center",
    "date": "October 6th",
    "time": "2:30PM",
    "description": "Join us for a time of worship and fellowship at the Bitterroot Valley Living Center. We will be leading a worship service for the residents and employees. For more information, contact the church office.",
    "eventExpires": "2024-10-06"
  },
  {
    "title": "Harvest Dinner",
    "date": "October 18th",
    "time": "6PM",
    "description": "Save the Date for our annual Harvest Dinner. More details to come.",
    "eventExpires": "2024-10-18"
  },
  {
    "title": "Informational Update Meeting",
    "date": "October 15th",
    "time": "6:30PM",
    "description": "Come and see what the plans are for the new construction and what progress has been made on the gym.",
    "eventExpires": "2024-10-15"
  },
  {
    "title": "Kids Bible Club",
    "date": "October 23rd",
    "time": "2:45-4:45 PM",
    "description": "Kids Bible club will be kicking off on Wednesdays, starting October 23rd. This is a fun time of games and learning about Jesus. Snacks are served. Grades K-6th",
    "eventExpires": "2024-10-23"
  },
  {
    "title": "Christmas Boxes",
    "date": "November 17th",
    "description": "Christmas boxes for Samaritan's Purse Operation Christmas Child are due November 17th. Please bring your filled boxes to the church by this date.",
    "eventExpires": "2024-11-17"
  }
]
