[
  {
    "date": "February 16th",
    "eventExpires": "2025-02-16",
    "title": "Food Bank Sunday",
    "description": "Please bring non-perishable food items to donate to the local food bank. Items can be placed in the donation box in the foyer."
  },
  {
    "date": "February 16th",
    "eventExpires": "2025-02-16",
    "title": "Baby Dedication",
    "description": "Celebrate with us as we dedicate our children to the Lord. If you would like to have your child dedicated, please contact the church office."
  },

  {
    "date": "February 26th",
    "eventExpires": "2025-02-26",
    "title": "Clothing Drive for the SAF House in Nepal",
    "description": "There is another team heading to the SAF house in Nepal this coming spring.!! To that end, Shauna is hosting a clothing drive for the month of February to send along. She will have a collection box set out in the foyer. Contact Shauna with questions."
  },
  {
    "date": "May 1st",
    "eventExpires": "2025-05-01",
    "title": "National Day of Prayer",
    "description": "Every year our church opens it’s doors for anyone to come pray on the National Day of Prayer date, which is May 1st this year.  We are looking for someone to oversee this.  It would require getting word out,  contacting NDP headquarters to get prayer request cards and misc. info that is free (or the church would cover the cost if any), open the church and supervise.  If you are interested contact Cheri in the office for more info."
  },

  {
    "title": "Ladies Spring Conference",
    "date": "March 8th",
    "description": "The Ladies Spring Conference will be held at Grace Bible Church in Bozeman. The theme is 'The Priorities of a Godly Woman', with Dr. Vanessa Ellen speaking.",
    "eventExpires": "2025-03-08",
    "eventLink": {
      "href": "https://www.gbcmt.org/womens-ministries/",
      "text": "More Information and Registration"
    },
    "sticky": true
  },
  {
    "title": "Father-Daughter Ball",
    "date": "March 1st",
    "time": "6:30-8PM",
    "description": "Bitterroot Momlife is hosting the Father-Daughter Ball at the Cornerstone Bible Church in Hamilton. Tickets can be purchased at the church office or from Katy Hofman. $25 in advance, $35 at the door, which included Dad and ALL his daughters.",
    "eventExpires": "2025-03-01",
    "eventLink": {
      "href": "https://www.eventbrite.com/e/bitterroot-momlife-2025-father-daughter-ball-tickets-1207835942819?aff=oddtdtcreator",
      "text": "More Information or Buy Online"
    }
  },
  {
    "title": "Ladies Morning Bible Study - Elijah",
    "date": "March 19th - April 30th",
    "description": "Ladies! Join us for our last morning Bible study before summer. We will be doing a six-week study on Elijah with Melissa Spoelstra as the DVD teacher. Books need to be ordered soon, so please call or text Louisa or the church office to be put on the list.",
    "eventExpires": "2025-03-19"
  },
  {
    "title": "Nursery & Pre-K/Kindergarten Volunteers Meeting",
    "date": "March 2nd",
    "time": "11:45AM",
    "description": "There will be a meeting after church for the nursery and Pre-K/Kindergarten class volunteers.",
    "eventExpires": "2025-03-02"
  },
  {
    "title": "Nursery Parents Meeting",
    "date": "March 16th",
    "time": "11:45AM",
    "description": "A brief introductory meeting for parents of nursery and preschool-aged children to meet the new nursery directors will be held following the morning service.",
    "eventExpires": "2025-03-16"
  }
]
