[
  {
    "date": "May 1st",
    "eventExpires": "2025-05-01",
    "title": "National Day of Prayer",
    "description": "Every year our church opens its doors for anyone to come pray on the National Day of Prayer date, which is May 1st this year.  We are looking for someone to oversee this.  It would require getting word out,  contacting NDP headquarters to get prayer request cards and misc. info that is free (or the church would cover the cost if any), open the church and supervise.  If you are interested contact Cheri in the office for more info."
  },
  {
    "title": "Nursery Parents Meeting",
    "date": "March 16th",
    "time": "11:45AM",
    "description": "A brief introductory meeting for parents of nursery and preschool-aged children to meet the new nursery directors will be held following the morning service.",
    "eventExpires": "2025-03-16"
  },
  {
    "title": "Calling Artists & Crafters",
    "date": "March 18th",
    "time": "11:00AM - 2:00PM",
    "description": "Bring your current projects, materials, and tools to join in a time of creating and community! Observers are welcome to come for fellowship also! In the Fellowship Hall, 11:00AM to 2:00PM, lunch will be served.",
    "eventExpires": "2025-04-18"
  },
  {
    "title": "Food Bank Sunday",
    "date": "March 16th",
    "description": "Please bring a non-perishable food item for our local food bank.",
    "eventExpires": "2025-03-16"
  },
  {
    "title": "Shepherd's Conference",
    "date": "April 22nd-24th",
    "description": "Join us for the Shepherd's Conference at Discovery Alliance Church in Missoula.",
    "eventExpires": "2025-04-24",
    "eventLink": {
      "href": "https://rmbible.org/shepherds-conference-2025",
      "text": "More Information and Registration"
    }
  },
  {
    "title": "Bitterroot Valley Living Center Ministry",
    "date": "March 9th",
    "time": "2:30PM",
    "description": "This Sunday, March 9th, we have the opportunity to minister to the residents at BVLC. Please come and worship with these dear people at 2:30PM at BVLC.",
    "eventExpires": "2025-03-09"
  }
]
